import { useNavigate } from "react-router-dom";

function ElDaawat() {
  const navigate = useNavigate();

  const goToHome = () => {
    navigate("/");
  };
  return (
    <div dir="rtl" lang="ar">
      <h1 className="text-da3">يلا ندعي ربنا🤲</h1>
      <div className="checkbox-taskes-d">
        <label className="checkboxs">
          <input type="checkbox" />
          اللهم اهدني فيمن هديت اللهم اشرح صدري لحبك اللهم ابك عيني من خشيتك
          ورفق قلبي لحبك وعلمني علما يوصلني اليك ويعرفني عليك اللهم اعني على
          ذكرك وشكرك وحسن عبادتك اللهم يا مقلب القلوب ثبت قلبي على دينك{" "}
        </label>
        <label className="checkboxs">
          <input type="checkbox" />
          اللهم حسن خلقي كما حسنت خلقي اللهم اهديني لحسن الاخلاق لا يهديك
          لاحسنها الا انت واصرف عنا سيئ الاخلاق لا يصرف سيئه الا انت ادعي ان
          ربنا يشفيك من عيبك باللطف والعافيه
        </label>
        <label className="checkboxs">
          <input type="checkbox" />
          اللهم وسع علينا في ارزاقنا حتى لا نمد ايدينا الا اليك وانا نتوكل
          بقلوبنا الا عليك اللهم صل علينا ارزاقنا بغير مهانه ولا مذل اللهم وسع
          علينا في ارزاقنا مع تمام الستر واللطف والعافيه{" "}
        </label>

        <label className="checkboxs">
          <input type="checkbox" />
          اللهم اشفي لنا من الاوجاع والالام واشفي مقولنا من الحزن والمخابز
          والاوهام
        </label>
      </div>

      <div className="btn-bac">
        <button className="back-btn" onClick={goToHome}>
          الرجوع للصفحة الرئيسية
        </button>
      </div>
    </div>
  );
}

export default ElDaawat;
